app/views/posts/index.html.erb

INSERT INTO "posts" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["title", nil], ["content", "関ヶ原の戦いはどうして起こったのですか？"], ["created_at", "2024-05-22 09:31:48.933524"], ["updated_at", "2024-05-22 09:31:48.933524"]]
---
            <span>@<%= post.user.name %></span>
            <small class="text-muted"><%= post.created_at.strftime("%Y-%m-%d %H:%M") %></small>

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" IN (?, ?, ?)  [["post_id", 26], ["post_id", 25], ["post_id", 24]]
---
          <div class="card-footer d-none">
            <% post.replies.each do |reply| %>