app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["title", nil], ["content", "ひとつ目の投稿です"], ["created_at", "2024-05-18 11:08:13.085315"], ["updated_at", "2024-05-18 11:08:13.085315"]]
INSERT INTO "posts" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["title", nil], ["content", "円安の原因は？\r\n"], ["created_at", "2024-05-22 10:52:29.759292"], ["updated_at", "2024-05-22 10:52:29.759292"]]
INSERT INTO "replies" ("post_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["post_id", 1], ["user_id", 2], ["content", "ひとつ目に対する返信です"], ["created_at", "2024-05-18 11:09:01.287177"], ["updated_at", "2024-05-18 11:09:01.287177"]]
---
  def create
    @content = params[:content]
    @post = Post.new(content: params[:content], user_id: session[:user_id])
  if @content != nil
    if @post.save
      api_key = ENV['CHAT_GPT_API_KEY']
      client = ChatGPTClient.new(api_key)
      @question = params[:content] + "また300文字以内に要約してください。"
      puts @question
      @answer = client.ask_question(@question)

      if @answer && @answer["choices"]
        reply_content = @answer["choices"].first["message"]["content"]
        reply = Reply.new(content: reply_content, user_id: 2, post_id: @post.id)
        if reply.save

INSERT INTO "posts" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 7], ["title", nil], ["content", "こんにちは"], ["created_at", "2024-05-19 15:09:23.669504"], ["updated_at", "2024-05-19 15:09:23.669504"]]
INSERT INTO "replies" ("post_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["post_id", 20], ["user_id", 5], ["content", "今、なんておっしゃいましたか？"], ["created_at", "2024-05-19 15:34:29.921276"], ["updated_at", "2024-05-19 15:34:29.921276"]]
---
  def reply
    reply = Reply.new(content: params[:content], user_id: session[:user_id], post_id: params[:post_id])
    if reply.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 19]]
---
def destroy
  @post = Post.find_by(id: params[:id])

  # 削除権限の確認
  if @post && (@current_user.id == @post.user_id || @current_user.id == 3)
    @post.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_current_user
    @current_user = User.find(session[:user_id]) if session[:user_id]