app/controllers/users_controller.rb

  def create
    @password = params[:password]
    @re_password = params[:password_confirmation]
    @name = params[:name]

    if @password == @re_password

    @user = User.new(name: @name, password: @password, password_confirmation: @re_password)
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "asahi"], ["created_at", "2024-05-24 04:34:36.655917"], ["updated_at", "2024-05-24 04:34:36.655917"], ["password_digest", "[FILTERED]"]]

  def login
    user = User.find_by(name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "tajeru"], ["LIMIT", 1]]